name = input('Введите имя: ')
surname = input('Введите фамилию: ')
yeaar = input('Введите год рождения: ')

# ИСПРАВИТЬ: вывод не соответствует требуемому формату (лишний текст)
# ИСПОЛЬЗОВАТЬ везде: круглые скобки используются для литерала кортежа, изменения порядка вычисления выражений, вызова функций и записи составного выражения на нескольких строчках — больше нигде и никак
print('\nДанные о пользователе: ', '\n', surname,' ', name, ', ', 2024 - int(yeaar), sep='')
# КОММЕНТАРИЙ: в случае, если вы будете генерировать строку не для чтения человеком, а для другой функции/класса/программы — неверный формат может стоить вам неработающего приложения


#Введите имя: Денис
#Введите фамилию: Серегин
#Введите год рождения: 2008
#
#Данные о пользователе:
#Серегин Денис, 16


# ИТОГ: доработать — 1/2

